content/man/man1/fincore.1.org
#+TITLE: Manpages - fincore.1
* NAME
fincore - count pages of file contents in core

* SYNOPSIS
*fincore* [options] /file/...

* DESCRIPTION
*fincore* counts pages of file contents being resident in memory (in
core), and reports the numbers. If an error occurs during counting, then
an error message is printed to the stderr and *fincore* continues
processing the rest of files listed in a command line.

The default output is subject to change. So whenever possible, you
should avoid using default outputs in your scripts. Always explicitly
define expected columns by using *--output* /columns-list/ in
environments where a stable output is required.

* OPTIONS
*-n*, *--noheadings*

#+begin_quote
Do not print a header line in status output.

#+end_quote

*-b*, *--bytes*

#+begin_quote
Print the sizes in bytes rather than in a human-readable format.

By default, the unit, sizes are expressed in, is byte, and unit prefixes
are in power of 2^10 (1024). Abbreviations of symbols are exhibited
truncated in order to reach a better readability, by exhibiting alone
the first letter of them; examples: "1 KiB" and "1 MiB" are respectively
exhibited as "1 K" and "1 M", then omitting on purpose the mention "iB",
which is part of these abbreviations.

#+end_quote

*-o*, *--output* /list/

#+begin_quote
Define output columns. See the *--help* output to get a list of the
currently supported columns. The default list of columns may be extended
if /list/ is specified in the format /+list/.

#+end_quote

*-r*, *--raw*

#+begin_quote
Produce output in raw format. All potentially unsafe characters are
hex-escaped (\x<code>).

#+end_quote

*-J*, *--json*

#+begin_quote
Use JSON output format.

#+end_quote

*-h*, *--help*

#+begin_quote
Display help text and exit.

#+end_quote

*-V*, *--version*

#+begin_quote
Print version and exit.

#+end_quote

* AUTHORS
* SEE ALSO
*mincore*(2), *getpagesize*(2), *getconf*(1p)

* REPORTING BUGS
For bug reports, use the issue tracker at
<https://github.com/util-linux/util-linux/issues>.

* AVAILABILITY
The *fincore* command is part of the util-linux package which can be
downloaded from /Linux Kernel Archive/
<https://www.kernel.org/pub/linux/utils/util-linux/>.
